app/controllers/categories_controller.rb

SELECT "sub_categories".* FROM "sub_categories" WHERE "sub_categories"."category_id" = ?  [["category_id", 1]]
---
	def index
		@categories = Category.all