app/views/categories/index.html.erb

SELECT "sub_categories".* FROM "sub_categories" WHERE "sub_categories"."category_id" = ?  [["category_id", 1]]
SELECT "sub_sub_categories".* FROM "sub_sub_categories" WHERE "sub_sub_categories"."sub_category_id" = ?  [["sub_category_id", 1]]
---
		<ul>
			<% category.sub_categories.each do |sub_category| %>

SELECT "products".* FROM "products" WHERE "products"."sub_sub_category_id" = ?  [["sub_sub_category_id", 1]]
---
						<ul>
							<% sub_sub_category.products.each do |product| %>